In [ ]:
!pip install pandas

In [114]:
import pandas as pd

In [ ]:
import matplotlib as plt
import numpy as np

In [ ]:
#new pandas dataframe
df = pd.DataFrame(
    {
        "location":pd.Categorical(['Kothrud','Aundh','Prabhat Road','Camp']),
        "Q1":[30,40,25,30],
        "Q2":[35,45,20,35],
        "Q3":[20,20,20,20],
        "Q4":[40,40,35,30],
        
    }
)

43

In [118]:
a = [1,2,3,4,5,6,7,8,9,10]

df2

In [126]:
two_table = pd.DataFrame(a).rename(columns={ 0 : "base"})

In [124]:
two_table.rename(columns={ 0 : "base"})

   base
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10

In [131]:
two_table

   base  output
0     1       2
1     2       4
2     3       6
3     4       8
4     5      10
5     6      12
6     7      14
7     8      16
8     9      18
9    10      20

In [130]:
two_table['output'] = two_table['base']* 2

In [ ]:
df3['Year'] = df2.sum(axis=1, numeric_only=True)

In [ ]:
df3

In [ ]:
df2.sum()

In [132]:
employee_df = pd.read_csv("employee_salary.txt")

employee_df

In [ ]:
print(employee_df)

In [ ]:
employee_df.groupby(['employee_name']).sum(['salary'])

In [ ]:
employee_df.nlargest(2, ['salary'])

In [ ]:
employee_df.groupby(['employee_name']).apply(lambda x: x.nlargest(2,['salary']),include_groups=False)

In [ ]:
a = [1,2,3,4]

In [ ]:
a[2]

In [ ]:
a = [1,2,3,4,5,6,7,8,9,10]

In [ ]:
two_table = pd.DataFrame(a).rename(columns={ 0 : "base"})

In [ ]:
two_table['output'] = two_table['base']*2

In [ ]:
two_table

In [133]:
df = pd.read_csv("employee_salary.txt")

In [134]:
df

  employee_name  salary month   dept
0          John     388   Jan  dept1
1          John      20   Feb  dept2
2          John      30   Mar  dept1
3          John      40   Apr  dept2
4         Sarah     100   Jan  dept1
5         Sarah       2   Feb  dept2
6         Sarah     322   Mar  dept1
7         Sarah     402   Apr  dept2

In [135]:
df['salary'].sum()

np.int64(1304)